const inside = require('point-in-polygon');

// const polygon = [[13.661485, 100.505113], [13.662238, 100.505735], [13.661506, 100.506210]];

const data = [
    {   'name': 'cosmo building',
        'location': [[13.661599, 100.505082], [13.662501, 100.505951], [13.661015, 100.505994]],
        'a1': 99,
        'a2': 99
    },
    {
        'name': 'the cube',
        'location': [[13.654853, 100.498868], [13.655312, 100.499834], [13.654499, 100.499727]],
        'a1': 99,
        'a2': 99
    },
    {
        'name': 'อาคารวิศววัฒนะ - บ้านธรรมรักษา 1',
        'location': [[13.650192, 100.495116], [13.649853, 100.494698], [13.649321, 100.494151]],
        'a1': 1,
        'a2': 7,
        'center': [13.650192, 100.495116]
    },
    {
        'name': 'สำนักงานอธิการบดี',
        'location': [[13.652076, 100.495402], [13.651838, 100.495397], [13.651539, 100.495388]],
        'a1': 0,
        'a2': 0,
        'center': [13.652076, 100.495402]
    },
    {
        'name': 'อาคารเรียนรวม 1',
        'location': [[13.651665, 100.492958], [13.651529, 100.492947], [13.651344, 100.492942]],
        'a1': 3,
        'center': [13.651665, 100.492958]
    },
    {
        'name': 'อาคารพระจอมเกล้าราชานุสรณ์ฯ',
        'location': [[13.651287, 100.492100], [13.651035, 100.492106], [13.650615, 100.492117]],
        'a2': 5,
        'center': [13.651035, 100.492106]
    },
    {
        'name': 'อาคารเรียนรวม 3',
        'location': [[13.650268, 100.492065], [13.650101, 100.492167], [13.649981, 100.492303]],
        'a1': 2,
        'a2': 6,
        'center': [13.650101, 100.492167]
    },
    {
        'name': 'สำนักหอสมุด',
        'location': [[13.652317, 100.493893], [13.652335, 100.494027], [13.652244, 100.493957]],
        'a2': 3,
        'center': [13.652317, 100.493893]
    },
    {
        'name': 'สถาบันวิทยาการหุ่นยนต์ฯ',
        'location': [[13.654032, 100.494387], [13.654048, 100.494567], [13.654025, 100.494822]],
        'a2': 2,
        'center': [13.654032, 100.494387]
    },
    {
        'name': 'อาคารเอนกประสงค์',
        'location': [[13.652188, 100.493295], [13.652094, 100.493147], [13.651789, 100.493024]],
        'a1': 4,
        'a2': 4,
        'center': [13.652188, 100.493295]
    },
    {
        'name': 'อาคารปฏิบัติการวิทยาศาสตร์ฯ',
        'location': [[13.653110, 100.494869], [13.653454, 100.494810], [13.653647, 100.494858]],
        'a1': 5,
        'a2': 1,
        'center': [13.653110, 100.494869]
    }
]


function readData(geo, data){
    console.log(data.location);
    for(k in data) {
        // console.log(data[k].name ,inside(geo, data[k].location));
        if(inside(geo, data[k].location) != false) {
            let dataExport = {
                'buildingName':data[k].name,
                'nodeRouteA1': data[k].a1,
                'nodeRouteA2': data[k].a2
            }
            console.log('bus at --> ' + data[k].name);
            return dataExport;
        }
    }
}

// console.log(inside([13.661868, 100.505719], polygon));
// console.log(inside([13.659761, 100.504119], polygon));

// const geodata = [13.655259, 100.497331];
// readData(geodata,data);

const run = geoImport => {
    let dataExport = readData(geoImport, data);
    return dataExport;
}

module.exports.run = run;